
[calendar0]
Order = 4
Type = 每周
Name = 冥城争霸
Week = 3
Level = 50-
NPC = 11608
Icon = 每周.dds
Color = 255-255-0
DayTime = 21-0-23-0
Desc = 每周三晚上8点50-9点00，玩家可以在祖龙地产官员处报名参加“冥城争霸”活动，玩家报名时需缴纳10万完美币作为门票。\r成功报名的玩家，会根据系统分配的阵营，传送到4个不同的场景中去，这4个场景内的地形和怪物都是完全相同的。被传送到一个场景内的玩家，就是被临时分配到一个阵营内的战友了，这个活动最重要的一个玩法就是，同一阵营的玩家在场景内做的每一点努力，不管是杀怪还是做任务，都会为本阵营增加战斗积分，在活动结束后，战斗积分最高的那个阵营，会得到三倍的奖励！

[calendar1]
Order = 4
Type = 每周
Name = 龙宫探险
Week = 2
Level = 60-
NPC = 11608
Icon = 每周.dds
Color = 255-255-0
DayTime = 20-0-24-0
Desc = 进入龙宫后，玩家将自动接到“龙宫探险”任务，放弃此任务玩家便被传送出龙宫。龙宫共有两个任务，分别是龙宫残章系列和潜龙封印任务，在完成这两个任务之后，便可以召唤出“龙宫探险”任务的最终BOSS——九龙子.螭吻。\r龙宫中藏有大量的宝藏，玩家调查宝藏将会有惊喜。同时，龙宫之中地形复杂，为了更清晰地辨别方位，玩家可以打开右上角的区域预设标记点，根据里面提供的方位来进行活动。

[calendar2]
Order = 3
Type = 每周
Name = 比武大会
Week = 4
Level = 50-
NPC = 20210
Icon = 每周.dds
Color = 255-255-0
DayTime = 20-0-22-0
Desc = 整个比赛共分为五轮，除了第一轮争夺比赛权的一轮不可以自由PK外，其他的四轮比赛中玩家都可以在指定的时间内进行PK。而整个比赛过程与电影《黄飞鸿》中的狮王争霸颇为相似，也就是说，最后的赢家必须要在指定的时间内夺到宝箱方可获胜。因此，这也增加了整个比赛的难度，不仅要求玩家能够尽快的战胜众多对手夺到宝箱，还要在争夺的过程中充分的保护好自己不被杀，如果在规定时间内没有拿到宝箱或者不幸牺牲，则标志着本轮比赛的失败。失败后，玩家将会被NPC传送出赛场。除第一轮比赛，余下的每轮比赛中都将决出六名最具实力的玩家进入下一轮，以此类推，最后决出冠军一名、亚军两名以及季军三名。

[calendar3]
Order = 2
Type = 城战
Name = 城战
Week = 6-7
Level = 0-
NPC = 0
Icon = 城战.dds
Color = 255-0-255
DayTime = 9-00-12-18
Desc = 攻城略地！\r^ffff00领土宣战规则：^ffffff一共7个时间段，每个时间段最多可以同时进行7场战争。这7个时间段按优先顺序为：周五晚 周六晚 周日晚 周六下午 周日下午 周六上午 周日上午。\r^ffff00战争时间安排的策略：^ffffff系统会尽量把一个帮会所有的领土防守战以3场战斗为一个单位编排在同一个时段，也就是说如果一个帮派占领的领土在一周内被多个帮派同时进攻，则这些进攻的战争会被3场3场地安排在一起。\r^ffff00城战的人数限制：^ffffff每个帮派可以进入同一个战争场景的人数上限为80人。\r^ffff00特别注意：^ffffff开战之前100小时之内新入帮派成员不能参加城战；SHIFT+鼠左键可以透过玩家选择NPC；ALT+鼠左键可以透过NPC选择玩家（投石车挡住玩家的时候可以用此方法选中玩家）。

[calendar4]
Order = 2
Type = 城战
Name = 城战
Week = 5
Level = 0-
NPC = 0
Icon = 城战.dds
Color = 255-0-255
DayTime = 20-0-23-18
Desc = 攻城略地！\r^ffff00领土宣战规则：^ffffff一共7个时间段，每个时间段最多可以同时进行7场战争。这7个时间段按优先顺序为：周五晚 周六晚 周日晚 周六下午 周日下午 周六上午 周日上午。\r^ffff00战争时间安排的策略：^ffffff系统会尽量把一个帮会所有的领土防守战以3场战斗为一个单位编排在同一个时段，也就是说如果一个帮派占领的领土在一周内被多个帮派同时进攻，则这些进攻的战争会被3场3场地安排在一起。\r^ffff00城战的人数限制：^ffffff每个帮派可以进入同一个战争场景的人数上限为80人。\r^ffff00特别注意：^ffffff开战之前100小时之内新入帮派成员不能参加城战；SHIFT+鼠左键可以透过玩家选择NPC；ALT+鼠左键可以透过NPC选择玩家（投石车挡住玩家的时候可以用此方法选中玩家）。

[calendar5]
Order = 5
Type = 每日
Name = 神无谷
Day = 0-0-0-0-0-0
Level = 40-
NPC = 17814
Icon = 每日.dds
Color = 128-255-0
DayTime = 0-0-0-0
Desc = 相同等级段的六名玩家组队后，由队长和神隐使徒对话后便可进入神无谷相应等级的活动场景。\r40级以上玩家，每日都可以在神隐使徒处获取一枚相应等级的鬼母令。凑齐6枚相应等级的鬼母令，交由队长和相应的NPC对话后开启活动，同时NPC会收走6枚鬼母令。\r杀死所有进攻的怪物，保护九子鬼母顺利存活到战斗结束，活动成功，反则失败。

[calendar6]
Order = 5
Type = 每日
Name = 命运魔方
Day = 0-0-0-0-0-0
Level = 40-
NPC = 11608
Icon = 每日.dds
Color = 128-255-0
DayTime = 0-0-0-0
Desc = 命运魔方是个神奇的地方，它一旦开启，你就可以在魔方世界里的各个房间内穿梭，里面的魔方大使将会给你不错的奖励。至于付出的代价是多少，就要看你的实力和运气了。命运魔方的各个房间会给你带来不同的惊喜，接下来会发生什么？等待你的是强大的BOSS还是高额的奖励？答案只有你自己知道。\r魔方的神奇转动会令每个人的探险经历互不相同，不要以为只有实力超强的人才能顺利过关，如果你的运气还不错的话，可能不用费吹灰之力就能安安全全的得到骰子，继续前行。有些房间会给大家带来了”天上掉馅饼“的好事，如果大家的魔幻骰子幸运的将你转到这样的房间里，那么就会省去很大的力气呢。

[calendar7]
Order = 5
Type = 每日
Name = 情迷祖龙之巅
Day = 0-0-0-0-0-0
Level = 30-
NPC = 22292+22296
Icon = 每日.dds
Color = 128-255-0
DayTime = 19-0-22-0
Desc = 选择男性角色的玩家，需要到祖龙城NPC侯方域处领取任务，随机得到任务物品（一见钟情，比翼双飞，情比金坚，花好月圆，天荒地老）的任意一种。 选择女性角色的玩家，在剑仙城NPC李香君处领取任务，随机得到任务物品（情有独钟，长相厮守，浓情蜜意，山盟海誓，海枯石烂）。得到对应配对物品的男女玩家可以组队到寻梦港NPC马伶处领取任务。队长必须是男性玩家。

[calendar8]
Order = 5
Type = 每日
Name = 轮回殿
Day = 0-0-0-0-0-0
Level = 100-
NPC = 25564
Icon = 每日.dds
Color = 128-255-0
DayTime = 0-0-0-0
Desc = ^ffffff通过轮回殿密匙进入轮回殿。\r^ffff00活动内容：^ffffff与神秘老人一起勇闯轮回殿，探究轮回殿的秘密。\r^ffff00轮回殿密匙获得方式：^ffffff一：在惊涛城于神秘老人对话。二：完成赏金猎人任务。

[calendar9]
Order = 5
Type = 每日
Name = 赏金猎人
Day = 0-0-0-0-0-0
Level = 40-
NPC = 24773
Icon = 每日.dds
Color = 128-255-0
DayTime = 0-0-0-0
Desc = 每日可接一次的额外奖励任务，杀死任务指定的boss之一，即可得奖，组队共享。奖励很丰厚哦！

[calendar10]
Order = 2
Type = 城战
Name = 城战
Week = 6-7
Level = 0-
NPC = 0
Icon = 城战.dds
Color = 255-0-255
DayTime = 14-00-17-18
Desc = 攻城略地！\r^ffff00领土宣战规则：^ffffff一共7个时间段，每个时间段最多可以同时进行7场战争。这7个时间段按优先顺序为：周五晚 周六晚 周日晚 周六下午 周日下午 周六上午 周日上午。\r^ffff00战争时间安排的策略：^ffffff系统会尽量把一个帮会所有的领土防守战以3场战斗为一个单位编排在同一个时段，也就是说如果一个帮派占领的领土在一周内被多个帮派同时进攻，则这些进攻的战争会被3场3场地安排在一起。\r^ffff00城战的人数限制：^ffffff每个帮派可以进入同一个战争场景的人数上限为80人。\r^ffff00特别注意：^ffffff开战之前100小时之内新入帮派成员不能参加城战；SHIFT+鼠左键可以透过玩家选择NPC；ALT+鼠左键可以透过NPC选择玩家（投石车挡住玩家的时候可以用此方法选中玩家）。

[calendar11]
Order = 2
Type = 城战
Name = 城战
Week = 6-7
Level = 0-
NPC = 0
Icon = 城战.dds
Color = 255-0-255
DayTime = 20-00-23-18
Desc = 攻城略地！\r^ffff00领土宣战规则：^ffffff一共7个时间段，每个时间段最多可以同时进行7场战争。这7个时间段按优先顺序为：周五晚 周六晚 周日晚 周六下午 周日下午 周六上午 周日上午。\r^ffff00战争时间安排的策略：^ffffff系统会尽量把一个帮会所有的领土防守战以3场战斗为一个单位编排在同一个时段，也就是说如果一个帮派占领的领土在一周内被多个帮派同时进攻，则这些进攻的战争会被3场3场地安排在一起。\r^ffff00城战的人数限制：^ffffff每个帮派可以进入同一个战争场景的人数上限为80人。\r^ffff00特别注意：^ffffff开战之前100小时之内新入帮派成员不能参加城战；SHIFT+鼠左键可以透过玩家选择NPC；ALT+鼠左键可以透过NPC选择玩家（投石车挡住玩家的时候可以用此方法选中玩家）。

[calendar12]
Order = 5
Type = 每日
Name = 残云一章
Day = 0-0-0-0-0-0
Level = 60-80
NPC = 25904
Icon = 每日.dds
Color = 128-255-0
DayTime = 9-00-24-00
Desc = 汐族与夜叉族正在残云岛上进行着战争，帮助汐族击败邪恶的夜叉族和怨灵，你将成为被汐族敬仰的勇士。找到孤云礁上的先锋官风振声可以领取任务，任务分阶段完成，所有参与任务的人的努力都将被计算在内。

[calendar13]
Order = 5
Type = 每日
Name = 残云二章
Day = 0-0-0-0-0-0
Level = 95-
NPC = 25905
Icon = 每日.dds
Color = 128-255-0
DayTime = 9-00-24-00
Desc = 汐族的部分军队被夜叉族围困在残云岛折戟台上，帮助汐族防守住敌人的进攻，你将成为被汐族敬仰的勇士。找到折戟台的斥候总领陆半翁可以领取任务，任务分阶段完成，所有参与任务的人的努力都将被计算在内。

[calendar14]
Order = 5
Type = 每日
Name = 残云三章
Day = 0-0-0-0-0-0
Level = 95-
NPC = 25907
Icon = 每日.dds
Color = 128-255-0
DayTime = 9-00-24-00
Desc = 汐族计划秘密攻打夜叉族的大本营暗潮大帐，帮助汐族完成这个艰巨的使命，杀死夜叉太子。找到暗潮大帐北部的海啸军特使可以领取任务，任务分阶段完成，所有参与任务的人的努力都将被计算在内。

[calendar15]
Order = 4
Type = 每周
Name = 仙魔劫
Week = 1
Level = 30-
NPC = 27927
Icon = 每周.dds
Color = 255-255-0
DayTime = 21-0-0-0
Desc = 每周一晚上9点00，玩家可以在祖龙城西或各大种族主城长老身边找虎神报名参加“仙魔劫”活动，活动需要玩家团结一心，击败八大仙魔虎煞及其4999个手下，根据玩家在整个活动中的表现，最终会由系统评定贡献度，排名进入各职业前20名的玩家将获得高额奖励，只要贡献度超过2000，即可获得活动的安慰奖，奖励同样丰厚！ 

[calendar16]
Order = 5
Type = 每日
Name = 修罗道
Day = 0-0-0-0-0-0
Level = 50-
NPC = 31482
Icon = 每日.dds
Color = 128-255-0
DayTime = 18-30-19-35
Desc = 每天晚上18：30，玩家可以在祖龙、万流、寻梦三城地产官员附近的南关狼主处报名参加“修罗道”活动。击败修罗道内怪物，收集“修罗之角”与“修罗之心”以换取奖励。需要注意的是，还要提防来自其他玩家的可能攻击。“修罗之角”是保底奖励，不会因死亡而失去。


[calendar17]
Order = 4
Type = 每周
Name = 丛林遗迹
Week = 2
Level = 30-
NPC = 20731
Icon = 每周.dds
Color = 255-255-0
DayTime = 20-30-21-00
Desc = 每周二晚上20点30至21点00之间，玩家可以在祖龙城西北，东北，东南，中间，寻找到“遗迹寻宝人”并在她处领取进入丛林遗迹的任务。接到该任务的玩家，只需在2个小时内抵达丛林遗迹的终点便能领取到相应的奖励，抵达终点所用的时间越短，获得的奖励越丰厚。遗迹中还伴有许多惊险刺激的任务，需要您去发掘。活动结束时间为10点30分，“丛林遗迹”的大门已经开启，让我们进入上古主神的神坛，寻找传说中的秘宝吧！